projects/case-c8f6a7a7/working/night_optimization/foam_candidates/candidate-b251f7f0/working/openfoam_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          673;
        startFace       355069;
    }
    outlet
    {
        type            patch;
        nFaces          1092;
        startFace       355742;
    }
    farField
    {
        type            patch;
        nFaces          4279;
        startFace       356834;
    }
    hull
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24394;
        startFace       361113;
    }
)

// ************************************************************************* //
